---
type: ColorOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# ColorOptions

`Autodesk.Revit.DB.ColorOptions` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetColorOptions | 2020.1 | `public static ColorOptions GetColorOptions ()` |
| Property | AlertColor | 2020.1 | `public Color AlertColor { get ; set ; }` |
| Property | BackgroundColor | 2020.1 | `public Color BackgroundColor { get ; set ; }` |
| Property | CalculatingColor | 2020.1 | `public Color CalculatingColor { get ; set ; }` |
| Property | EditingColor | 2020.1 | `public Color EditingColor { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | PreselectionColor | 2020.1 | `public Color PreselectionColor { get ; set ; }` |
| Property | SelectionColor | 2020.1 | `public Color SelectionColor { get ; set ; }` |
| Property | SelectionSemitransparent | 2020.1 | `public bool SelectionSemitransparent { get ; set ; }` |